app/controllers/uploads_controller.rb

SELECT * FROM "uploads"
---
  def index
    @uploads = Upload.all

SELECT * FROM "uploads" WHERE ("uploads"."id" = 1)
---
  def show
    @upload = Upload.find(params[:id])

INSERT INTO "uploads" ("name", "created_at", "updated_at", "content") VALUES(E'Untitled.txt', '2009-12-14 22:32:39.017672', '2009-12-14 22:32:39.017672', E'file upload\\012- upload text file and put contents in db table.\\012- test in spec to verify it works\\012- write tutorial for how to do file upload in rails via tdd.\\012\\012\\012\\012\\012tab-delimited text\\012\\012\\012\\012\\012\\012\\012questions: \\012hosting on heroku: \\012file hosting = where?\\012\\012\\012\\012\\012\\012References to steps:\\012http://railsforum.com/viewtopic.php?id=35726\\012\\012\\012http://robwilkerson.org/2009/08/26/learning-ruby-on-rails-file-upload/\\012\\012Rails has a very nice feature, in my opinion, that encapsulates the entirety of a save action in a transaction.\\012\\012\\012\\012\\012http://www.frederico-araujo.com/tag/content_type/\\012uses command line tool \\342\\200\\234file\\342\\200\\235 included in most UNIX operating systems to retrieve content type/mime type') RETURNING "id"
---
  def create
    puts "================================= create"
    puts params[:upload]
    puts params[:upload][:file]
    file = params[:upload][:file]
    @upload = Upload.new(:name => file.original_path, :content => file.read )

    respond_to do |format|
      if @upload.save

SELECT * FROM "uploads" WHERE ("uploads"."id" = 2)
DELETE FROM "uploads" WHERE "id" = 2
---
  def destroy
    @upload = Upload.find(params[:id])
    @upload.destroy